<!-- terraform cdk action for options with hash ea4e3265923454c20a9e9049fa7b0805 -->
### ❌ Error applying Terraform CDK Stack 'cdktf'



<details><summary>Error: The process '/usr/local/bin/npx' failed with exit code 1</summary>

```shell
cdktf  Initializing HCP Terraform...
cdktf  Initializing modules...
cdktf  Downloading registry.terraform.io/oracle-terraform-modules/vcn/oci 3.6.0 for oci0_oci0-base_vcn_D4433BAC...
cdktf  - oci0_oci0-base_vcn_D4433BAC in .terraform/modules/oci0_oci0-base_vcn_D4433BAC
cdktf  - oci0_oci0-base_vcn_D4433BAC.subnet in .terraform/modules/oci0_oci0-base_vcn_D4433BAC/modules/subnet
       Downloading registry.terraform.io/oracle-terraform-modules/vcn/oci 3.6.0 for oci1_oci1-base_vcn_51671EF0...
cdktf  - oci1_oci1-base_vcn_51671EF0 in .terraform/modules/oci1_oci1-base_vcn_51671EF0
cdktf  - oci1_oci1-base_vcn_51671EF0.subnet in .terraform/modules/oci1_oci1-base_vcn_51671EF0/modules/subnet
       Downloading registry.terraform.io/oracle-terraform-modules/vcn/oci 3.6.0 for oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA...
cdktf  - oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA in .terraform/modules/oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA
cdktf  - oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.subnet in .terraform/modules/oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA/modules/subnet
       Downloading registry.terraform.io/oracle-terraform-modules/vcn/oci 3.6.0 for oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02...
cdktf  - oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02 in .terraform/modules/oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02
cdktf  - oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.subnet in .terraform/modules/oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02/modules/subnet
cdktf  Initializing provider plugins...
       - Finding tailscale/tailscale versions matching "0.17.1"...
cdktf  - Finding cloudflare/cloudflare versions matching "4.42.0"...
cdktf  - Finding oracle/oci versions matching ">= 4.67.3, 6.10.0"...
cdktf  - Finding hashicorp/random versions matching "3.6.3"...
cdktf  - Installing hashicorp/random v3.6.3...
cdktf  - Installed hashicorp/random v3.6.3 (signed by HashiCorp)
cdktf  - Installing tailscale/tailscale v0.17.1...
cdktf  - Installed tailscale/tailscale v0.17.1 (self-signed, key ID 6B5A366F1FD32BD0)
cdktf  - Installing cloudflare/cloudflare v4.42.0...
cdktf  - Installed cloudflare/cloudflare v4.42.0 (self-signed, key ID C76001609EE3B136)
cdktf  - Installing oracle/oci v6.10.0...
cdktf  - Installed oracle/oci v6.10.0 (signed by a HashiCorp partner, key ID 1533A49284137CEB)
       Partner and community providers are signed by their developers.
       If you'd like to know more about provider signing, you can read about it here:
       https://www.terraform.io/docs/cli/plugins/signing.html
       Terraform has created a lock file .terraform.lock.hcl to record the provider
       selections it made above. Include this file in your version control repository
       so that Terraform can guarantee to make the same selections by default when
       you run "terraform init" in the future.
cdktf  HCP Terraform has been successfully initialized!

       You may now begin working with HCP Terraform. Try running "terraform plan" to
       see any changes that are required for your infrastructure.

       If you ever set or change modules or Terraform Settings, run "terraform init"
       again to reinitialize your working directory.
cdktf  - Fetching tailscale/tailscale 0.17.1 for linux_amd64...
cdktf  - Retrieved tailscale/tailscale 0.17.1 for linux_amd64 (self-signed, key ID 6B5A366F1FD32BD0)
cdktf  - Fetching cloudflare/cloudflare 4.42.0 for linux_amd64...
cdktf  - Retrieved cloudflare/cloudflare 4.42.0 for linux_amd64 (self-signed, key ID C76001609EE3B136)
cdktf  - Fetching oracle/oci 6.10.0 for linux_amd64...
cdktf  - Retrieved oracle/oci 6.10.0 for linux_amd64 (signed by a HashiCorp partner, key ID 1533A49284137CEB)
cdktf  - Fetching hashicorp/random 3.6.3 for linux_amd64...
cdktf  - Retrieved hashicorp/random 3.6.3 for linux_amd64 (signed by HashiCorp)
       - Obtained tailscale/tailscale checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
       - Obtained cloudflare/cloudflare checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
       - Obtained oracle/oci checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
       - Obtained hashicorp/random checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
cdktf  Success! Terraform has validated the lock file and found no need for changes.
cdktf  Running apply in HCP Terraform. Output will stream here. Pressing Ctrl-C
       will cancel the remote apply if it's still pending. If the apply started it
       will stop streaming the logs, but will not stop the apply running remotely.

       Preparing the remote apply...
cdktf  To view this run in a browser, visit:
       https://app.terraform.io/app/jon77p-xyz/infrastructure/runs/run-vrrsEgRw5EcizpHf
cdktf  Waiting for the plan to start...
cdktf  Terraform v1.9.6
       on linux_amd64
cdktf  Initializing plugins and modules...
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A: Refreshing state... [id=ocid1.instance.oc1.phx.anyhqljrvaxvekycyle7kdkdc5hyg4c66c5umuva43pixeydh2ahibfmbdta]
       random_id.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_secret_C958FD23 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_secret): Refreshing state... [id=--lICuPVvkH3Fe5y13QPPY-proP34zIKH99hNzGDoJKNN7o]
cdktf  cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_certificate_A60801EE: Refreshing state... [id=083bae34d0e9ea92be443e8b722598cb903d3dbfb39a4e26]
       random_id.oci1_oci1-vault-tunnel_tunnel_secret_48460AC7 (oci1/oci1/oci1-vault-tunnel/tunnel_secret): Refreshing state... [id=-NVWV_ZSv9R6CQYpqwvZTqrFgatSaA-k7BKx5ak1jVZJMr4]
cdktf  random_id.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_secret_B58DB779 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_secret): Refreshing state... [id=Glhvgj-vi6m0TruXboPkYZh_y8HBp3Xf0UCiN8upEIFTBU0]
       random_id.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_secret_7446B080: Refreshing state... [id=d9AfnqX0ezd8PUqQVqlv3Av6KLwfbUnucuLTDYW1-smdeb0]
cdktf  data.cloudflare_zones.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_cf_zones_0B8286FB (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/cf_zones): Refreshing...
       cloudflare_zero_trust_access_policy.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_policy_9D8D690D: Refreshing state... [id=1832c0e7-e544-40d9-9d40-228b19c071f8]
       cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-record_1F10E1F6: Refreshing state... [id=df766edc4c94935aea4671c4077f430e]
       cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_oci2-us-phoenix-1-monitoring-tunnel_1D6A8503: Refreshing state... [id=0d2fcf76-3818-4719-a2c8-7274e50c9e8f]
       cloudflare_zero_trust_access_application.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_app_EBE2D141: Refreshing state... [id=9ad30c40-8c77-494f-af25-a3e3b51a5de9]
cdktf  cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_app_oci2-us-phoenix-1-monitoring-tunnel_43F08681: Refreshing state... [id=d477f99dde797073265f752166a14a9a]
       cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_app_oci2-us-phoenix-1-monitoring-tunnel_DEC9A5C2: Refreshing state... [id=cc80ba25f79c8bb248b621fa1d153476]
cdktf  data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_cf_zones_CA2BE853 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/cf_zones): Refreshing...
       data.cloudflare_zones.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_cf_zones_0B8286FB (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/cf_zones): Refresh complete after 1s [id=26917df6062007ddfe496b5780dfddff]
       data.cloudflare_zones.oci1_oci1-vault-tunnel_cf_zones_4E15E863 (oci1/oci1/oci1-vault-tunnel/cf_zones): Refreshing...
       data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_cf_zones_thepi_cloud_E25C89DE (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/cf_zones_thepi_cloud): Refreshing...
       cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_config_oci2-us-phoenix-1-monitoring-tunnel_4F63B19F: Refreshing state... [id=0d2fcf76-3818-4719-a2c8-7274e50c9e8f]
cdktf  data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_cf_zones_2A981C6F (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/cf_zones): Refreshing...
       tailscale_tailnet_key.tailscale_auth_key (tailscale_auth_key): Refreshing state... [id=kQU4mHDLv911CNTRL]
cdktf  cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_oci2-us-sanjose-1-healthchecks-tunnel_36ADB018 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_oci2-us-sanjose-1-healthchecks-tunnel): Refreshing state... [id=491d0111-6836-4515-9bb6-20e0ade12a7c]
       cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_oci2-us-sanjose-1-auth-tunnel_FAA28023 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_oci2-us-sanjose-1-auth-tunnel): Refreshing state... [id=1a54b4fc-edea-4531-97f2-34283bbf6091]
       cloudflare_zero_trust_tunnel_cloudflared.oci1_oci1-vault-tunnel_tunnel_oci1-vault-tunnel_2066D201 (oci1/oci1/oci1-vault-tunnel/tunnel_oci1-vault-tunnel): Refreshing state... [id=dead9a0a-014b-47d7-b0c1-6e256ad60c3f]
       oci_identity_compartment.oci2_terraform_3F88AD18 (oci2/terraform): Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq]
cdktf  data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_cf_zones_CA2BE853 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/cf_zones): Refresh complete after 2s [id=26917df6062007ddfe496b5780dfddff]
       oci_identity_compartment.oci0_terraform_38B13C88 (oci0/terraform): Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaaifb5znbuiwdij3lnc7vunthpdjxpn52f6dwzdwd7vgivsk65q6vq]
cdktf  oci_identity_compartment.oci1_terraform_7FF23FED (oci1/terraform): Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda]
       data.cloudflare_zones.oci1_oci1-vault-tunnel_cf_zones_4E15E863 (oci1/oci1/oci1-vault-tunnel/cf_zones): Refresh complete after 1s [id=26917df6062007ddfe496b5780dfddff]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ingress_record_auth_jon77p_xyz_3D3EF4C0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ingress_record_auth_jon77p_xyz): Refreshing state... [id=e515c1251cbce112aca6fd465b42da6d]
       cloudflare_zero_trust_access_application.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_app_A26FBCE9 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_app): Refreshing state... [id=1a6105f2-8bbb-4d5e-9484-0e71ee40c4a5]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_app_oci2-us-sanjose-1-auth-tunnel_A298E943 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_app_oci2-us-sanjose-1-auth-tunnel): Refreshing state... [id=a186ba9f0472d402330ca9ad3a339fa9]
       data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_cf_zones_thepi_cloud_E25C89DE (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/cf_zones_thepi_cloud): Refresh complete after 2s [id=f64dd1d129b18dfb86637e568821ec50]
       data.oci_identity_availability_domain.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ads_7BD871F0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ads): Refreshing...
       data.oci_identity_availability_domain.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ads_E0439301 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ads): Refreshing...
       data.oci_identity_availability_domain.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ads_7BD871F0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ads): Refresh complete after 0s [id=ocid1.availabilitydomain.oc1..aaaaaaaavi2wyd6rjjffu5nzgb3gjq4thy46k7sgw5ibh7mu5sq5fyie6t5a]
       data.oci_core_vcns.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_core_vcn_FC0CC604 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/core_vcn): Refreshing...
cdktf  data.oci_identity_availability_domain.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ads_E0439301 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ads): Refresh complete after 0s [id=ocid1.availabilitydomain.oc1..aaaaaaaavi2wyd6rjjffu5nzgb3gjq4thy46k7sgw5ibh7mu5sq5fyie6t5a]
       data.oci_core_vcns.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_core_vcn_1C9F3188 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/core_vcn): Refreshing...
cdktf  data.oci_identity_availability_domain.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ads_A38EDF06 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ads): Refreshing...
       data.oci_core_vcns.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_core_vcn_FC0CC604 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/core_vcn): Refresh complete after 0s [id=CoreVcnsDataSource-1699921964]
       cloudflare_record.oci1_oci1-vault-tunnel_ssh_app_oci1-vault-tunnel_FE5AB979 (oci1/oci1/oci1-vault-tunnel/ssh_app_oci1-vault-tunnel): Refreshing state... [id=70c80ee55b33e3a109439db22918e5a3]
       data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_cf_zones_2A981C6F (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/cf_zones): Refresh complete after 2s [id=26917df6062007ddfe496b5780dfddff]
       cloudflare_zero_trust_access_application.oci1_oci1-vault-tunnel_ssh_app_68D668B6 (oci1/oci1/oci1-vault-tunnel/ssh_app): Refreshing state... [id=c7f8c997-c490-43d7-820f-140c2b879021]
       data.oci_identity_availability_domain.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ads_A38EDF06 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ads): Refresh complete after 1s [id=ocid1.availabilitydomain.oc1..aaaaaaaac7uydq54rcymamzauv5pd23qk2g2vqlrfu5jd3y6i6qxpvvzkf7a]
       cloudflare_record.oci1_oci1-vault-tunnel_ingress_record_vault_jon77p_xyz_5D7A9265 (oci1/oci1/oci1-vault-tunnel/ingress_record_vault_jon77p_xyz): Refreshing state... [id=3fe1c8efbb2fdf221b43d065c2262431]
       data.oci_core_vcns.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_core_vcn_1C9F3188 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/core_vcn): Refresh complete after 1s [id=CoreVcnsDataSource-1699921964]
       cloudflare_record.oci1_oci1-vault-tunnel_ingress_record_opconnect_jon77p_xyz_1B7A5737 (oci1/oci1/oci1-vault-tunnel/ingress_record_opconnect_jon77p_xyz): Refreshing state... [id=dbe9ee99a7364c2884047bba057e83d5]
cdktf  data.oci_core_vcns.oci0_oci0-base_core_vcn_8F8E2055 (oci0/oci0/oci0-base/core_vcn): Refreshing...
       data.oci_identity_availability_domain.oci1_oci1-vault-compute_ads_12D6B9C9 (oci1/oci1/oci1-vault-compute/ads): Refreshing...
cdktf  data.oci_core_vcns.oci0_oci0-base_core_vcn_8F8E2055 (oci0/oci0/oci0-base/core_vcn): Refresh complete after 1s [id=CoreVcnsDataSource-3604188111]
       data.oci_core_vcns.oci1_oci1-base_core_vcn_5A15CF74 (oci1/oci1/oci1-base/core_vcn): Refreshing...
       data.oci_identity_availability_domain.oci1_oci1-vault-compute_ads_12D6B9C9 (oci1/oci1/oci1-vault-compute/ads): Refresh complete after 0s [id=ocid1.availabilitydomain.oc1..aaaaaaaavi2wyd6rjjffu5nzgb3gjq4thy46k7sgw5ibh7mu5sq5fyie6t5a]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ingress_record_healthchecks_thepi_cloud_6389B44E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ingress_record_healthchecks_thepi_cloud): Refreshing state... [id=eae4e14590f8b9d2578762eda49106ae]
       module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_vcn.vcn: Refreshing state... [id=ocid1.vcn.oc1.us-sanjose-1.amaaaaaavaxvekyalqzun5ifhvhrlao2jyu74eyk5usszmyf3waetjsx4rmq]
cdktf  data.oci_core_vcns.oci1_oci1-base_core_vcn_5A15CF74 (oci1/oci1/oci1-base/core_vcn): Refresh complete after 0s [id=CoreVcnsDataSource-2346786270]
       data.oci_core_boot_volumes.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_all_boot_volumes_C3CB241A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/all_boot_volumes): Refreshing...
cdktf  module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_vcn.vcn: Refreshing state... [id=ocid1.vcn.oc1.phx.amaaaaaavaxvekyarjvfvjrasj7k6wjpgwdszc5hmqlc6ymzzt2tfmpo4f7a]
       data.oci_core_boot_volumes.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_all_boot_volumes_98671A9E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/all_boot_volumes): Refreshing...
       data.oci_core_boot_volumes.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_all_boot_volumes_C3CB241A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/all_boot_volumes): Refresh complete after 0s [id=CoreBootVolumesDataSource-2744709155]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_app_oci2-us-sanjose-1-healthchecks-tunnel_69E906E3 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_app_oci2-us-sanjose-1-healthchecks-tunnel): Refreshing state... [id=ab8b77ec955582b22ce2923b4774c0d6]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ingress_record_healthchecks_jon77p_xyz_B4CBE9EA (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ingress_record_healthchecks_jon77p_xyz): Refreshing state... [id=4a1966a83a11fe44b967d3e5f2a9eda7]
       data.oci_core_boot_volumes.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_all_boot_volumes_98671A9E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/all_boot_volumes): Refresh complete after 0s [id=CoreBootVolumesDataSource-2744709155]
       cloudflare_zero_trust_access_application.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_app_7271D789 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_app): Refreshing state... [id=d53d7997-0893-416f-ab71-3813431b3c82]
       data.oci_core_boot_volumes.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_all_boot_volumes_0EC61C1F (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/all_boot_volumes): Refreshing...
       data.oci_core_boot_volumes.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_all_boot_volumes_0EC61C1F (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/all_boot_volumes): Refresh complete after 0s [id=CoreBootVolumesDataSource-2286997786]
       module.oci0_oci0-base_vcn_D4433BAC.oci_core_vcn.vcn: Refreshing state... [id=ocid1.vcn.oc1.us-sanjose-1.amaaaaaakausufiawvhccj5na6fgukt55idgvuwz6oxuxppchwkucykqkpya]
       cloudflare_zero_trust_access_policy.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_policy_AB9BEA0A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_policy): Refreshing state... [id=4ba4f5d5-0356-4d8c-86d2-145159c20112]
       cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_certificate_9E655C25 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_certificate): Refreshing state... [id=80e280bba2cfb1c7fb83f0b93853632445d0e5abc01a2963]
       module.oci1_oci1-base_vcn_51671EF0.oci_core_vcn.vcn: Refreshing state... [id=ocid1.vcn.oc1.us-sanjose-1.amaaaaaaral6dnyazx5js62r7byz5coah7q3ydm5td2tqospnrarqfdladzq]
cdktf  data.oci_core_boot_volumes.oci1_oci1-vault-compute_all_boot_volumes_C357A53D (oci1/oci1/oci1-vault-compute/all_boot_volumes): Refreshing...
       module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_default_security_list.lockdown[0]: Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaaxtr7mjutnldyymcpypxb664aejeq26kh2vtcubwhhcknurds7ttq]
cdktf  module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_internet_gateway.ig[0]: Refreshing state... [id=ocid1.internetgateway.oc1.us-sanjose-1.aaaaaaaayvztzez36b75cwjge7qgldkxvy3vojdqhft5jheopuzbbla4je7q]
       data.oci_core_boot_volumes.oci1_oci1-vault-compute_all_boot_volumes_C357A53D (oci1/oci1/oci1-vault-compute/all_boot_volumes): Refresh complete after 1s [id=CoreBootVolumesDataSource-2062574658]
       module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_internet_gateway.ig[0]: Refreshing state... [id=ocid1.internetgateway.oc1.phx.aaaaaaaajxb7st3mq35s4bplypp57xmxkmgpvi6aq5snrce3k77w2jhxuszq]
       module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_default_security_list.lockdown[0]: Refreshing state... [id=ocid1.securitylist.oc1.phx.aaaaaaaaejqniplxid6hmuclowhsl74w6yzv6uu544mnuiwu6v3cdot53daa]
       cloudflare_zero_trust_access_short_lived_certificate.oci1_oci1-vault-tunnel_ssh_certificate_66EDB87A (oci1/oci1/oci1-vault-tunnel/ssh_certificate): Refreshing state... [id=32a8d6d54964452d82c0dc9a138f6772be92fcd886b6ba7b]
       cloudflare_zero_trust_access_policy.oci1_oci1-vault-tunnel_ssh_policy_11AD3224 (oci1/oci1/oci1-vault-tunnel/ssh_policy): Refreshing state... [id=b159d8b9-8897-491b-8e67-b7aa2579a7c8]
cdktf  module.oci0_oci0-base_vcn_D4433BAC.oci_core_default_security_list.lockdown[0]: Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaag57fq3pfzgkbochyed4rqyrcddn25s3jpvirj6bbqeotls5f3eya]
cdktf  module.oci0_oci0-base_vcn_D4433BAC.oci_core_internet_gateway.ig[0]: Refreshing state... [id=ocid1.internetgateway.oc1.us-sanjose-1.aaaaaaaag2aj3c3enodxesoc34h2grrcop47e4dtgbgazsuzrfgsyxrhk2ca]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_app_oci2-us-sanjose-1-healthchecks-tunnel_3877712B (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_app_oci2-us-sanjose-1-healthchecks-tunnel): Refreshing state... [id=6f68342b8a4b1cf42f8aaa74256964fb]
cdktf  module.oci1_oci1-base_vcn_51671EF0.oci_core_internet_gateway.ig[0]: Refreshing state... [id=ocid1.internetgateway.oc1.us-sanjose-1.aaaaaaaaityfw6ve3az2wjqpasxnyx66ahlnqtgfgmoizoal5j2whv2g7b4q]
cdktf  module.oci1_oci1-base_vcn_51671EF0.oci_core_default_security_list.lockdown[0]: Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaa4wjsjitbn4ljsaqzm2j5iygvo4f6cc4otdf6l3egoacq3x2tmmva]
cdktf  oci_core_security_list.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_security_list_26368F93 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/security_list): Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaaxrc4f4tlkmgbo2s532zsczio676a3cubdfu52xb2gr2nokjp7kva]
cdktf  cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_app_oci2-us-sanjose-1-auth-tunnel_DC6BF9E8 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_app_oci2-us-sanjose-1-auth-tunnel): Refreshing state... [id=465b523b137f5715b1f27f69f00c0c2e]
       oci_core_security_list.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_security_list_FC3DADC1 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/security_list): Refreshing state... [id=ocid1.securitylist.oc1.phx.aaaaaaaaztrccu4ldwgkqdfvpso42fpnjgyevkgvmbdtcwauftptyltlmd7q]
       module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_route_table.ig[0]: Refreshing state... [id=ocid1.routetable.oc1.us-sanjose-1.aaaaaaaavsf3rv2q3qzztzicekvcvg7akgdoqhkiip447geu3iqq5vl6o2za]
       cloudflare_record.oci1_oci1-vault-tunnel_tunnel_app_oci1-vault-tunnel_C7B9BEDE (oci1/oci1/oci1-vault-tunnel/tunnel_app_oci1-vault-tunnel): Refreshing state... [id=c697ab72be5d2a3779e48cee051c6c9c]
       module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_route_table.ig[0]: Refreshing state... [id=ocid1.routetable.oc1.phx.aaaaaaaanx5vudvrhnq35ulihzdvl5xcnfuym625xsiffaey6lmthdpqqzta]
       oci_core_security_list.oci0_oci0-base_security_list_3B303AEE (oci0/oci0/oci0-base/security_list): Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaawtp6d5c6ozttjuaqwl3mb5nvzxrvgau4axetce7qw5zbodxcwwia]
       oci_core_security_list.oci1_oci1-base_security_list_86B45958 (oci1/oci1/oci1-base/security_list): Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaadp5drabvdrgwngdlrznym57teme2dwq2vz53gxmzedgulyziqxhq]
       module.oci0_oci0-base_vcn_D4433BAC.oci_core_route_table.ig[0]: Refreshing state... [id=ocid1.routetable.oc1.us-sanjose-1.aaaaaaaax7d4ml5husv43cxsmoayue4vgonjdcn4p5n7zzx7h326bd4ovlhq]
       module.oci1_oci1-base_vcn_51671EF0.oci_core_route_table.ig[0]: Refreshing state... [id=ocid1.routetable.oc1.us-sanjose-1.aaaaaaaajbzpf4bmxuijiddf4nussdevcyhemgemmwi7gxnow7sjok35kcmq]
cdktf  cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_certificate_C8A986EF (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_certificate): Refreshing state... [id=38b70b4e3d9f21056d9d4cbfba58105226bd25698fc61b12]
cdktf  cloudflare_zero_trust_access_policy.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_policy_7BF7147D (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_policy): Refreshing state... [id=3102b295-0795-49e9-a89a-001fa0d01bd5]
       oci_core_subnet.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public_DF13F306 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/public): Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaauu5jb3n3oudws7kq6tceavx5xzdtabwmvy6icacqnloshzg5pdoa]
       oci_core_subnet.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private_173502B2 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/private): Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaagr2ylwvroyg6u2hip5r6uwz3ui3kg4cdg3lk67lkwrci5aun7baq]
cdktf  oci_core_subnet.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private_4162BE1B (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/private): Refreshing state... [id=ocid1.subnet.oc1.phx.aaaaaaaadhungsdaobawobgr2aukzcpvxhxnssd2a5fxt2x7qfybmmeyb5hq]
       oci_core_subnet.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public_4382CEA5 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/public): Refreshing state... [id=ocid1.subnet.oc1.phx.aaaaaaaa4vxbukr52hdm7a3racepsrpfeitz2acuga4qfh2m3i6c7u4vdrna]
cdktf  oci_core_subnet.oci0_oci0-base_private_3EAB705B (oci0/oci0/oci0-base/private): Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaaixrvhcwutdybcv5njiix5e7otfq67j4puk4ttkdeou44lrntbnzq]
       oci_core_subnet.oci0_oci0-base_public_F5847813 (oci0/oci0/oci0-base/public): Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaam2c6conenj437sda2znq722gq4gxn23v6nvescrmrnivotmj4ugq]
cdktf  oci_core_subnet.oci1_oci1-base_public_E80D1048 (oci1/oci1/oci1-base/public): Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaatcy2zpk2hatnuh7ud3miikq47ub2qxhcryx7act6anl5m4bv3bea]
       oci_core_subnet.oci1_oci1-base_private_757CEF5F (oci1/oci1/oci1-base/private): Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaatyttz7qfuzjgq2qsaxcxz25432c2ip2bks5ekrb52ot27zxdxycq]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Refreshing state... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekyc77hdvotl26i37pfsdtoqzzubfo7qiysvwykerrxagqua]
       oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Refreshing state... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnyck75ebblulqacb6iyg56ff3jx7agfpnasohfjo3lm6hda]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel): Refreshing state... [id=491d0111-6836-4515-9bb6-20e0ade12a7c]
cdktf  cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_config_oci2-us-sanjose-1-auth-tunnel_DAA5878E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_config_oci2-us-sanjose-1-auth-tunnel): Refreshing state... [id=1a54b4fc-edea-4531-97f2-34283bbf6091]
cdktf  cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-record_0CBEF4D0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-record): Refreshing state... [id=088bc807ead737ed3fa6983fbc7ebfd4]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci1_oci1-vault-tunnel_tunnel_config_oci1-vault-tunnel_A3D5E910 (oci1/oci1/oci1-vault-tunnel/tunnel_config_oci1-vault-tunnel): Refreshing state... [id=dead9a0a-014b-47d7-b0c1-6e256ad60c3f]
       cloudflare_record.oci1_oci1-vault-record_DD9AADE3 (oci1/oci1/oci1-vault-record): Refreshing state... [id=b08082b9ad457e047dd24056901770b3]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Refreshing state... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekycoxyp7usdgsxlfw5tp63lk7antdgthzyejzquzwniafeq]
cdktf  cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-record_515A97A6 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-record): Refreshing state... [id=63167681b29dd7c53160cea2ad0221b1]
cdktf  cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-record_1F10E1F6: Drift detected (update)
       cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_app_oci2-us-phoenix-1-monitoring-tunnel_43F08681: Drift detected (update)
cdktf  Terraform used the selected providers to generate the following execution plan.
       Resource actions are indicated with the following symbols:
         + create
         ~ update in-place
         - destroy

       Terraform will perform the following actions:
cdktf  # cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-record_0B972CEE (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-record) will be created
         + resource "cloudflare_record" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-record_0B972CEE" {
             + allow_overwrite = false
             + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = (known after apply)
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "cicd.oci2-us-phoenix-1.jon77p.xyz"
             + proxiable       = (known after apply)
             + proxied         = false
             + ttl             = (known after apply)
             + type            = "A"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_oci2-us-phoenix-1-cicd-tunnel_EDF64A2C (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_app_oci2-us-phoenix-1-cicd-tunnel) will be created
         + resource "cloudflare_record" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_oci2-us-phoenix-1-cicd-tunnel_EDF64A2C" {
             + allow_overwrite = false
             + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = "tunnel-cicd.jon77p.xyz"
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "ssh-cicd"
             + proxiable       = (known after apply)
             + proxied         = true
             + ttl             = (known after apply)
             + type            = "CNAME"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_app_oci2-us-phoenix-1-cicd-tunnel_B9119A9A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_app_oci2-us-phoenix-1-cicd-tunnel) will be created
         + resource "cloudflare_record" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_app_oci2-us-phoenix-1-cicd-tunnel_B9119A9A" {
             + allow_overwrite = false
             + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = (known after apply)
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "tunnel-cicd"
             + proxiable       = (known after apply)
             + proxied         = true
             + ttl             = (known after apply)
             + type            = "CNAME"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-record_1F10E1F6 will be destroyed
         - resource "cloudflare_record" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-record_1F10E1F6" {
             - allow_overwrite = false -> null
             - comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}" -> null
             - content         = "129.146.32.169" -> null
             - created_on      = "2024-09-21T01:30:46.858934Z" -> null
             - hostname        = "monitoring.oci2-us-phoenix-1.thepi.cloud" -> null
             - id              = "df766edc4c94935aea4671c4077f430e" -> null
             - metadata        = {
                 - "auto_added"             = "false"
                 - "managed_by_apps"        = "false"
                 - "managed_by_argo_tunnel" = "false"
               } -> null
             - modified_on     = "2024-09-21T01:30:46.858934Z" -> null
             - name            = "monitoring.oci2-us-phoenix-1.thepi.cloud" -> null
             - proxiable       = true -> null
             - proxied         = false -> null
             - ttl             = 1 -> null
cdktf  - type            = "A" -> null
             - zone_id         = "bcd015486feab8e90475de6390e8b83f" -> null
           }

         # cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_app_oci2-us-phoenix-1-monitoring-tunnel_DEC9A5C2 will be destroyed
         - resource "cloudflare_record" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_app_oci2-us-phoenix-1-monitoring-tunnel_DEC9A5C2" {
             - allow_overwrite = false -> null
             - comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}" -> null
             - content         = "tunnel-monitoring.thepi.cloud" -> null
             - created_on      = "2024-09-21T01:10:14.344807Z" -> null
             - hostname        = "ssh-monitoring.thepi.cloud" -> null
             - id              = "cc80ba25f79c8bb248b621fa1d153476" -> null
             - metadata        = {
                 - "auto_added"             = "false"
                 - "managed_by_apps"        = "false"
                 - "managed_by_argo_tunnel" = "false"
               } -> null
             - modified_on     = "2024-09-21T01:10:14.344807Z" -> null
             - name            = "ssh-monitoring" -> null
             - proxiable       = true -> null
             - proxied         = true -> null
             - tags            = [] -> null
             - ttl             = 1 -> null
             - type            = "CNAME" -> null
             - zone_id         = "bcd015486feab8e90475de6390e8b83f" -> null
           }

         # cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_app_oci2-us-phoenix-1-monitoring-tunnel_43F08681 will be destroyed
         - resource "cloudflare_record" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_app_oci2-us-phoenix-1-monitoring-tunnel_43F08681" {
             - allow_overwrite = false -> null
             - comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}" -> null
             - content         = "0d2fcf76-3818-4719-a2c8-7274e50c9e8f.cfargotunnel.com" -> null
             - created_on      = "2024-09-21T01:30:10.283172Z" -> null
             - hostname        = "tunnel-monitoring.thepi.cloud" -> null
             - id              = "d477f99dde797073265f752166a14a9a" -> null
             - metadata        = {
                 - "auto_added"             = "false"
                 - "managed_by_apps"        = "false"
                 - "managed_by_argo_tunnel" = "false"
               } -> null
             - modified_on     = "2024-09-21T01:30:10.283172Z" -> null
             - name            = "tunnel-monitoring" -> null
             - proxiable       = true -> null
             - proxied         = true -> null
             - ttl             = 1 -> null
             - type            = "CNAME" -> null
             - zone_id         = "bcd015486feab8e90475de6390e8b83f" -> null
           }

         # cloudflare_zero_trust_access_application.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_D8A92F3E (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_app) will be created
         + resource "cloudflare_zero_trust_access_application" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_D8A92F3E" {
             + account_id                   = (known after apply)
             + allowed_idps                 = [
                 + "5bf62a31-b558-4f66-8542-9263cfab24de",
               ]
             + app_launcher_visible         = false
             + aud                          = (known after apply)
             + auto_redirect_to_identity    = true
             + domain                       = "ssh-cicd.jon77p.xyz"
             + enable_binding_cookie        = false
             + id                           = (known after apply)
             + name                         = "ssh-cicd.jon77p.xyz"
             + options_preflight_bypass     = false
             + service_auth_401_redirect    = false
             + session_duration             = "24h"
             + skip_app_launcher_login_page = false
             + skip_interstitial            = true
             + type                         = "ssh"
             + zone_id                      = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_zero_trust_access_application.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_app_EBE2D141 will be destroyed
cdktf  - resource "cloudflare_zero_trust_access_application" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_app_EBE2D141" {
             - allow_authenticate_via_warp  = false -> null
             - allowed_idps                 = [
                 - "5bf62a31-b558-4f66-8542-9263cfab24de",
               ] -> null
             - app_launcher_visible         = false -> null
             - aud                          = "c23462fc4d1c6b29a3c9424f3b6a8cc357a5d75bc6d4d10a620a1527df2fe479" -> null
             - auto_redirect_to_identity    = true -> null
             - custom_pages                 = [] -> null
             - domain                       = "ssh-monitoring.thepi.cloud" -> null
             - enable_binding_cookie        = false -> null
             - http_only_cookie_attribute   = false -> null
             - id                           = "9ad30c40-8c77-494f-af25-a3e3b51a5de9" -> null
             - name                         = "ssh-monitoring.thepi.cloud" -> null
             - options_preflight_bypass     = false -> null
             - service_auth_401_redirect    = false -> null
             - session_duration             = "24h" -> null
             - skip_app_launcher_login_page = false -> null
             - skip_interstitial            = true -> null
             - tags                         = [] -> null
             - type                         = "ssh" -> null
             - zone_id                      = "bcd015486feab8e90475de6390e8b83f" -> null
               # (8 unchanged attributes hidden)
           }

         # cloudflare_zero_trust_access_policy.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_policy_D05C6E16 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_policy) will be created
         + resource "cloudflare_zero_trust_access_policy" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_policy_D05C6E16" {
             + application_id = (known after apply)
             + decision       = "allow"
             + id             = (known after apply)
             + name           = "Policy for ssh-cicd.jon77p.xyz"
             + precedence     = 2
             + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"

             + include {
                 + group = [
                     + "6a723869-ecbd-4685-b03a-dd0197601aeb",
                   ]
               }
           }

         # cloudflare_zero_trust_access_policy.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_policy_9D8D690D will be destroyed
         - resource "cloudflare_zero_trust_access_policy" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_policy_9D8D690D" {
             - application_id                 = "9ad30c40-8c77-494f-af25-a3e3b51a5de9" -> null
             - approval_required              = false -> null
             - decision                       = "allow" -> null
             - id                             = "1832c0e7-e544-40d9-9d40-228b19c071f8" -> null
             - isolation_required             = false -> null
             - name                           = "Policy for ssh-monitoring.thepi.cloud" -> null
             - precedence                     = 2 -> null
             - purpose_justification_required = false -> null
             - zone_id                        = "bcd015486feab8e90475de6390e8b83f" -> null
               # (1 unchanged attribute hidden)

             - include {
                 - any_valid_service_token = false -> null
                 - certificate             = false -> null
                 - common_names            = [] -> null
                 - device_posture          = [] -> null
                 - email                   = [] -> null
                 - email_domain            = [] -> null
                 - email_list              = [] -> null
                 - everyone                = false -> null
                 - geo                     = [] -> null
                 - group                   = [
                     - "6a723869-ecbd-4685-b03a-dd0197601aeb",
                   ] -> null
                 - ip                      = [] -> null
                 - ip_list                 = [] -> null
                 - login_method            = [] -> null
                 - service_token           = [] -> null
                   # (2 unchanged attributes hidden)
               }
           }

         # cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_certificate_E83230F5 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_certificate) will be created
cdktf  + resource "cloudflare_zero_trust_access_short_lived_certificate" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_certificate_E83230F5" {
             + account_id     = (known after apply)
             + application_id = (known after apply)
             + aud            = (known after apply)
             + id             = (known after apply)
             + public_key     = (known after apply)
             + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_certificate_A60801EE will be destroyed
         - resource "cloudflare_zero_trust_access_short_lived_certificate" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_certificate_A60801EE" {
             - application_id = "9ad30c40-8c77-494f-af25-a3e3b51a5de9" -> null
             - aud            = "c23462fc4d1c6b29a3c9424f3b6a8cc357a5d75bc6d4d10a620a1527df2fe479" -> null
             - id             = "083bae34d0e9ea92be443e8b722598cb903d3dbfb39a4e26" -> null
             - public_key     = "ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBILnFS7iZzfQdojCUMwY0YkXt/vVeSLQ2ud5GWeB6WkKVt1QemNiW43QO/xTY1gkXuL+geEfVj2z9oWJtcXu7Dg= open-ssh-ca@cloudflareaccess.org" -> null
             - zone_id        = "bcd015486feab8e90475de6390e8b83f" -> null
           }

         # cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_oci2-us-phoenix-1-cicd-tunnel_53FE648A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_oci2-us-phoenix-1-cicd-tunnel) will be created
         + resource "cloudflare_zero_trust_tunnel_cloudflared" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_oci2-us-phoenix-1-cicd-tunnel_53FE648A" {
             + account_id   = (sensitive value)
             + cname        = (known after apply)
             + config_src   = "cloudflare"
             + id           = (known after apply)
             + name         = "cicd"
             + secret       = (sensitive value)
             + tunnel_token = (sensitive value)
           }

         # cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_oci2-us-phoenix-1-monitoring-tunnel_1D6A8503 will be destroyed
         - resource "cloudflare_zero_trust_tunnel_cloudflared" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_oci2-us-phoenix-1-monitoring-tunnel_1D6A8503" {
             - account_id   = (sensitive value) -> null
             - cname        = "0d2fcf76-3818-4719-a2c8-7274e50c9e8f.cfargotunnel.com" -> null
             - config_src   = "cloudflare" -> null
             - id           = "0d2fcf76-3818-4719-a2c8-7274e50c9e8f" -> null
             - name         = "monitoring" -> null
             - secret       = (sensitive value) -> null
             - tunnel_token = (sensitive value) -> null
           }

         # cloudflare_zero_trust_tunnel_cloudflared_config.oci1_oci1-vault-tunnel_tunnel_config_oci1-vault-tunnel_A3D5E910 (oci1/oci1/oci1-vault-tunnel/tunnel_config_oci1-vault-tunnel) will be updated in-place
         ~ resource "cloudflare_zero_trust_tunnel_cloudflared_config" "oci1_oci1-vault-tunnel_tunnel_config_oci1-vault-tunnel_A3D5E910" {
               id         = "dead9a0a-014b-47d7-b0c1-6e256ad60c3f"
               # (2 unchanged attributes hidden)

             ~ config {
                 + warp_routing {
                     + enabled = true
                   }

                   # (8 unchanged blocks hidden)
               }
           }

         # cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_config_oci2-us-phoenix-1-cicd-tunnel_82FEA1E0 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_config_oci2-us-phoenix-1-cicd-tunnel) will be created
         + resource "cloudflare_zero_trust_tunnel_cloudflared_config" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_config_oci2-us-phoenix-1-cicd-tunnel_82FEA1E0" {
             + account_id = (sensitive value)
             + id         = (known after apply)
             + tunnel_id  = (known after apply)

             + config {
                 + ingress_rule {
                     + hostname = (known after apply)
                     + service  = "ssh://cicd:22"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/_healthcheck$"
                     + service  = "http_status:200"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/metrics$"
cdktf  + service  = "http://localhost:2000"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/ready$"
                     + service  = "http://localhost:2000"
                   }
                 + ingress_rule {
                     + hostname = (known after apply)
                     + service  = "hello-world"
                   }
                 + ingress_rule {
                     + service = "http_status:404"
                   }
                 + warp_routing {
                     + enabled = true
                   }
               }
           }

         # cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_config_oci2-us-phoenix-1-monitoring-tunnel_4F63B19F will be destroyed
         - resource "cloudflare_zero_trust_tunnel_cloudflared_config" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_config_oci2-us-phoenix-1-monitoring-tunnel_4F63B19F" {
             - account_id = (sensitive value) -> null
             - id         = "0d2fcf76-3818-4719-a2c8-7274e50c9e8f" -> null
             - tunnel_id  = "0d2fcf76-3818-4719-a2c8-7274e50c9e8f" -> null

             - config {
                 - ingress_rule {
                     - hostname = "ssh-monitoring.thepi.cloud" -> null
                     - service  = "ssh://monitoring:22" -> null
                       # (1 unchanged attribute hidden)
                   }
                 - ingress_rule {
                     - hostname = "*" -> null
                     - path     = "^/_healthcheck$" -> null
                     - service  = "http_status:200" -> null
                   }
                 - ingress_rule {
                     - hostname = "*" -> null
                     - path     = "^/metrics$" -> null
                     - service  = "http://localhost:2000" -> null
                   }
                 - ingress_rule {
                     - hostname = "*" -> null
                     - path     = "^/ready$" -> null
                     - service  = "http://localhost:2000" -> null
                   }
                 - ingress_rule {
                     - hostname = "tunnel-monitoring.thepi.cloud" -> null
                     - service  = "hello-world" -> null
                       # (1 unchanged attribute hidden)
                   }
                 - ingress_rule {
                     - service  = "http_status:404" -> null
                       # (2 unchanged attributes hidden)
                   }
               }
           }

         # cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_config_oci2-us-sanjose-1-auth-tunnel_DAA5878E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_config_oci2-us-sanjose-1-auth-tunnel) will be updated in-place
         ~ resource "cloudflare_zero_trust_tunnel_cloudflared_config" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_config_oci2-us-sanjose-1-auth-tunnel_DAA5878E" {
               id         = "1a54b4fc-edea-4531-97f2-34283bbf6091"
               # (2 unchanged attributes hidden)

             ~ config {
                 + warp_routing {
                     + enabled = true
                   }

                   # (7 unchanged blocks hidden)
               }
           }

         # cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel) will be updated in-place
         ~ resource "cloudflare_zero_trust_tunnel_cloudflared_config" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470" {
               id         = "491d0111-6836-4515-9bb6-20e0ade12a7c"
               # (2 unchanged attributes hidden)

             ~ config {
                 + warp_routing {
                     + enabled = true
                   }

                   # (8 unchanged blocks hidden)
               }
           }

         # oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance) will be updated in-place
         ~ resource "oci_core_instance" "oci1_oci1-vault-compute_ubuntu_instance_3E6E0388" {
               id                          = "ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnyck75ebblulqacb6iyg56ff3jx7agfpnasohfjo3lm6hda"
               # (23 unchanged attributes hidden)

             ~ source_details {
cdktf  ~ source_id                       = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa" -> "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljreozywd2p65q72syl76slcrlz5to6wyqgdm6c4h2ogj4b5rjxe7dq"
                 ~ source_type                     = "image" -> "bootVolume"
                   # (4 unchanged attributes hidden)
               }

               # (6 unchanged blocks hidden)
           }

         # oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ubuntu_instance_665A76B8 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ubuntu_instance) will be created
         + resource "oci_core_instance" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ubuntu_instance_665A76B8" {
             + availability_domain                 = "EHXP:PHX-AD-1"
             + boot_volume_id                      = (known after apply)
             + capacity_reservation_id             = (known after apply)
             + compartment_id                      = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
             + compute_cluster_id                  = (known after apply)
             + dedicated_vm_host_id                = (known after apply)
             + defined_tags                        = (known after apply)
             + display_name                        = "cicd"
             + extended_metadata                   = (known after apply)
             + fault_domain                        = (known after apply)
             + freeform_tags                       = (known after apply)
             + hostname_label                      = (known after apply)
             + id                                  = (known after apply)
             + image                               = (known after apply)
             + instance_configuration_id           = (known after apply)
             + ipxe_script                         = (known after apply)
             + is_cross_numa_node                  = (known after apply)
             + is_pv_encryption_in_transit_enabled = (known after apply)
             + launch_mode                         = (known after apply)
             + metadata                            = (known after apply)
             + preserve_boot_volume                = true
             + private_ip                          = (known after apply)
             + public_ip                           = (known after apply)
             + region                              = (known after apply)
             + shape                               = "VM.Standard.A1.Flex"
             + state                               = (known after apply)
             + subnet_id                           = (known after apply)
             + system_tags                         = (known after apply)
             + time_created                        = (known after apply)
             + time_maintenance_reboot_due         = (known after apply)

             + agent_config (known after apply)

             + availability_config (known after apply)

             + create_vnic_details {
                 + assign_ipv6ip             = (known after apply)
                 + assign_private_dns_record = true
                 + assign_public_ip          = "true"
                 + defined_tags              = (known after apply)
                 + display_name              = (known after apply)
                 + freeform_tags             = (known after apply)
                 + hostname_label            = "cicd"
                 + nsg_ids                   = (known after apply)
                 + private_ip                = (known after apply)
                 + skip_source_dest_check    = (known after apply)
                 + subnet_id                 = "ocid1.subnet.oc1.phx.aaaaaaaa4vxbukr52hdm7a3racepsrpfeitz2acuga4qfh2m3i6c7u4vdrna"
                 + vlan_id                   = (known after apply)

                 + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
               }

             + instance_options (known after apply)

             + launch_options (known after apply)

             + launch_volume_attachments (known after apply)

             + platform_config (known after apply)

             + preemptible_instance_config (known after apply)

             + shape_config {
                 + baseline_ocpu_utilization     = (known after apply)
                 + gpu_description               = (known after apply)
                 + gpus                          = (known after apply)
                 + local_disk_description        = (known after apply)
cdktf  + local_disks                   = (known after apply)
                 + local_disks_total_size_in_gbs = (known after apply)
                 + max_vnic_attachments          = (known after apply)
                 + memory_in_gbs                 = 24
                 + networking_bandwidth_in_gbps  = (known after apply)
                 + nvmes                         = (known after apply)
                 + ocpus                         = 4
                 + processor_description         = (known after apply)
                 + vcpus                         = (known after apply)
               }

             + source_details {
                 + boot_volume_size_in_gbs = (known after apply)
                 + boot_volume_vpus_per_gb = (known after apply)
                 + source_id               = "ocid1.image.oc1.phx.aaaaaaaahnj5t3jk6za5prnsz3ikp35kjxfbqagxmhbtwbhirmnoghpjukhq"
                 + source_type             = "image"

                 + instance_source_image_filter_details (known after apply)
               }
           }

         # oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A will be destroyed
         - resource "oci_core_instance" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A" {
             - availability_domain         = "EHXP:PHX-AD-1" -> null
             - boot_volume_id              = "ocid1.bootvolume.oc1.phx.abyhqljrmocedue3fnn6uhnn6jlrtkf2jsa4jrxwdeysqt3rnugys7xuqffq" -> null
             - compartment_id              = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq" -> null
             - defined_tags                = {
                 - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                 - "Oracle-Tags.CreatedOn" = "2024-09-21T01:30:10.946Z"
               } -> null
             - display_name                = "monitoring" -> null
             - extended_metadata           = {} -> null
             - fault_domain                = "FAULT-DOMAIN-2" -> null
             - freeform_tags               = {} -> null
             - hostname_label              = "monitoring" -> null
             - id                          = "ocid1.instance.oc1.phx.anyhqljrvaxvekycyle7kdkdc5hyg4c66c5umuva43pixeydh2ahibfmbdta" -> null
             - image                       = "ocid1.image.oc1.phx.aaaaaaaahnj5t3jk6za5prnsz3ikp35kjxfbqagxmhbtwbhirmnoghpjukhq" -> null
             - is_cross_numa_node          = false -> null
             - launch_mode                 = "PARAVIRTUALIZED" -> null
             - metadata                    = {
                 - "user_data" = (sensitive value)
               } -> null
             - preserve_boot_volume        = true -> null
             - private_ip                  = "10.0.0.31" -> null
             - public_ip                   = "129.146.32.169" -> null
             - region                      = "phx" -> null
             - shape                       = "VM.Standard.A1.Flex" -> null
             - state                       = "RUNNING" -> null
             - subnet_id                   = "ocid1.subnet.oc1.phx.aaaaaaaa4vxbukr52hdm7a3racepsrpfeitz2acuga4qfh2m3i6c7u4vdrna" -> null
             - system_tags                 = {} -> null
             - time_created                = "2024-09-21 01:30:11.761 +0000 UTC" -> null
               # (1 unchanged attribute hidden)

             - agent_config {
                 - are_all_plugins_disabled = false -> null
                 - is_management_disabled   = false -> null
                 - is_monitoring_disabled   = false -> null
               }

             - availability_config {
                 - is_live_migration_preferred = false -> null
                 - recovery_action             = "RESTORE_INSTANCE" -> null
               }

             - create_vnic_details {
                 - assign_ipv6ip             = false -> null
                 - assign_private_dns_record = true -> null
                 - assign_public_ip          = "true" -> null
                 - defined_tags              = {
                     - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                     - "Oracle-Tags.CreatedOn" = "2024-09-21T01:30:11.154Z"
                   } -> null
                 - display_name              = "monitoring" -> null
                 - freeform_tags             = {} -> null
cdktf  - hostname_label            = "monitoring" -> null
                 - nsg_ids                   = [] -> null
                 - private_ip                = "10.0.0.31" -> null
                 - skip_source_dest_check    = false -> null
                 - subnet_id                 = "ocid1.subnet.oc1.phx.aaaaaaaa4vxbukr52hdm7a3racepsrpfeitz2acuga4qfh2m3i6c7u4vdrna" -> null
                   # (1 unchanged attribute hidden)
               }

             - instance_options {
                 - are_legacy_imds_endpoints_disabled = false -> null
               }

             - launch_options {
                 - boot_volume_type                    = "PARAVIRTUALIZED" -> null
                 - firmware                            = "UEFI_64" -> null
                 - is_consistent_volume_naming_enabled = true -> null
                 - is_pv_encryption_in_transit_enabled = false -> null
                 - network_type                        = "PARAVIRTUALIZED" -> null
                 - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
               }

             - shape_config {
                 - gpus                          = 0 -> null
                 - local_disks                   = 0 -> null
                 - local_disks_total_size_in_gbs = 0 -> null
                 - max_vnic_attachments          = 4 -> null
                 - memory_in_gbs                 = 24 -> null
                 - networking_bandwidth_in_gbps  = 4 -> null
                 - nvmes                         = 0 -> null
                 - ocpus                         = 4 -> null
                 - processor_description         = "3.0 GHz Ampere® Altra™" -> null
                 - vcpus                         = 4 -> null
                   # (3 unchanged attributes hidden)
               }

             - source_details {
                 - boot_volume_size_in_gbs         = "47" -> null
                 - boot_volume_vpus_per_gb         = "10" -> null
                 - is_preserve_boot_volume_enabled = false -> null
                 - source_id                       = "ocid1.image.oc1.phx.aaaaaaaahnj5t3jk6za5prnsz3ikp35kjxfbqagxmhbtwbhirmnoghpjukhq" -> null
                 - source_type                     = "image" -> null
                   # (1 unchanged attribute hidden)
               }
           }

         # random_id.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_secret_2FA2656E (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_secret) will be created
         + resource "random_id" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_secret_2FA2656E" {
             + b64_std     = (known after apply)
             + b64_url     = (known after apply)
             + byte_length = 35
             + dec         = (known after apply)
             + hex         = (known after apply)
             + id          = (known after apply)
           }

         # random_id.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_secret_7446B080 will be destroyed
         - resource "random_id" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_secret_7446B080" {
             - b64_std     = "d9AfnqX0ezd8PUqQVqlv3Av6KLwfbUnucuLTDYW1+smdeb0=" -> null
             - b64_url     = "d9AfnqX0ezd8PUqQVqlv3Av6KLwfbUnucuLTDYW1-smdeb0" -> null
             - byte_length = 35 -> null
             - dec         = "909206851351675907256055968032564378237878187224068788230796259869029365916731537853" -> null
             - hex         = "77d01f9ea5f47b377c3d4a9056a96fdc0bfa28bc1f6d49ee72e2d30d85b5fac99d79bd" -> null
             - id          = "d9AfnqX0ezd8PUqQVqlv3Av6KLwfbUnucuLTDYW1-smdeb0" -> null
           }

       Plan: 10 to add, 4 to change, 10 to destroy.

       Changes to Outputs:
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_boot-volumes_0CD39B1D                    = {
             + availability_domain = "EHXP:PHX-AD-1"
             + boot_volumes        = []
             + compartment_id      = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
             + filter              = [
                 + {
                     + name   = "display_name"
                     + regex  = true
                     + values = [
                         + "cicd",
                       ]
                   },
                 + {
                     + name   = "state"
                     + regex  = false
                     + values = [
                         + "AVAILABLE",
                       ]
                   },
               ]
cdktf  + id                  = "CoreBootVolumesDataSource-2286997786"
             + volume_group_id     = null
           }
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_instance-boot-volume_A567D4B1            = (known after apply)
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_instance-display-name_BC2EAE2A           = "cicd"
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_instance-hostname_5405EE68               = "cicd"
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_instance-source-details_FC3F5228         = {
             + boot_volume_size_in_gbs              = (known after apply)
             + boot_volume_vpus_per_gb              = (known after apply)
             + instance_source_image_filter_details = (known after apply)
             + is_preserve_boot_volume_enabled      = null
             + kms_key_id                           = null
             + source_id                            = "ocid1.image.oc1.phx.aaaaaaaahnj5t3jk6za5prnsz3ikp35kjxfbqagxmhbtwbhirmnoghpjukhq"
             + source_type                          = "image"
           }
         - oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_boot-volumes_E66EF43B              = {
             - availability_domain = "EHXP:PHX-AD-1"
             - boot_volumes        = []
             - compartment_id      = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
             - filter              = [
                 - {
                     - name   = "display_name"
                     - regex  = true
                     - values = [
                         - "monitoring",
                       ]
                   },
                 - {
                     - name   = "state"
                     - regex  = false
                     - values = [
                         - "AVAILABLE",
                       ]
                   },
               ]
             - id                  = "CoreBootVolumesDataSource-2286997786"
             - volume_group_id     = null
           } -> null
         - oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_instance-boot-volume_56D85552      = "ocid1.bootvolume.oc1.phx.abyhqljrmocedue3fnn6uhnn6jlrtkf2jsa4jrxwdeysqt3rnugys7xuqffq" -> null
         - oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_instance-display-name_336862EB     = "monitoring" -> null
         - oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_instance-hostname_859C06CE         = "monitoring" -> null
         - oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_instance-source-details_EBF73E6F   = {
             - boot_volume_size_in_gbs              = "47"
             - boot_volume_vpus_per_gb              = "10"
             - instance_source_image_filter_details = []
             - is_preserve_boot_volume_enabled      = false
             - kms_key_id                           = ""
             - source_id                            = "ocid1.image.oc1.phx.aaaaaaaahnj5t3jk6za5prnsz3ikp35kjxfbqagxmhbtwbhirmnoghpjukhq"
             - source_type                          = "image"
           } -> null

       Post-plan Tasks:
cdktf  All tasks completed! 1 passed, 0 failed           (4s elapsed)

       │ Snyk ⸺   Passed
cdktf  │ No issues found.
       Severity threshold is set to low.
       │ Details: https://app.snyk.io/org/jon77p/project/0fe83cb2-98ca-4577-b078-fd048f4c1e02/history/8e5445d5-4de0-41e0-837d-f8cf307b6b48
       │
       │
       │ Overall Result: Passed

       ------------------------------------------------------------------------
cdktf  ------------------------------------------------------------------------
cdktf  Cost Estimation:

       Resources: 0 of 73 estimated
                  $0.0/mo +$0.0

       ------------------------------------------------------------------------
cdktf
cdktf  random_id.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_secret_2FA2656E (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_secret): Creating...
       cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-record_1F10E1F6: Destroying... [id=df766edc4c94935aea4671c4077f430e]
cdktf  cloudflare_zero_trust_access_policy.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_policy_9D8D690D: Destroying... [id=1832c0e7-e544-40d9-9d40-228b19c071f8]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_config_oci2-us-phoenix-1-monitoring-tunnel_4F63B19F: Destroying... [id=0d2fcf76-3818-4719-a2c8-7274e50c9e8f]
       cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_oci2-us-phoenix-1-cicd-tunnel_EDF64A2C (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_app_oci2-us-phoenix-1-cicd-tunnel): Creating...
       random_id.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_secret_2FA2656E (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_secret): Creation complete after 0s [id=hfhyyOVgSI9CkFf9cHaTUjIe-rjT4UETtj-vYhW4AZoxCJc]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci1_oci1-vault-tunnel_tunnel_config_oci1-vault-tunnel_A3D5E910 (oci1/oci1/oci1-vault-tunnel/tunnel_config_oci1-vault-tunnel): Modifying... [id=dead9a0a-014b-47d7-b0c1-6e256ad60c3f]
       cloudflare_zero_trust_access_application.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_D8A92F3E (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_app): Creating...
       cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_oci2-us-phoenix-1-cicd-tunnel_53FE648A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_oci2-us-phoenix-1-cicd-tunnel): Creating...
       cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel): Modifying... [id=491d0111-6836-4515-9bb6-20e0ade12a7c]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_config_oci2-us-sanjose-1-auth-tunnel_DAA5878E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_config_oci2-us-sanjose-1-auth-tunnel): Modifying... [id=1a54b4fc-edea-4531-97f2-34283bbf6091]
       oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Modifying... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnyck75ebblulqacb6iyg56ff3jx7agfpnasohfjo3lm6hda]
       cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-record_1F10E1F6: Destruction complete after 0s
       oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A: Destroying... [id=ocid1.instance.oc1.phx.anyhqljrvaxvekycyle7kdkdc5hyg4c66c5umuva43pixeydh2ahibfmbdta]
cdktf  cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_config_oci2-us-phoenix-1-monitoring-tunnel_4F63B19F: Destruction complete after 1s
cdktf  cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_app_oci2-us-phoenix-1-monitoring-tunnel_43F08681: Destroying... [id=d477f99dde797073265f752166a14a9a]
cdktf  cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_oci2-us-phoenix-1-cicd-tunnel_EDF64A2C (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_app_oci2-us-phoenix-1-cicd-tunnel): Creation complete after 3s [id=3863aa25c10fca7af87cc0abc5e04640]
       cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_app_oci2-us-phoenix-1-monitoring-tunnel_DEC9A5C2: Destroying... [id=cc80ba25f79c8bb248b621fa1d153476]
       cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_app_oci2-us-phoenix-1-monitoring-tunnel_43F08681: Destruction complete after 2s
cdktf  cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel): Modifications complete after 3s [id=491d0111-6836-4515-9bb6-20e0ade12a7c]
       cloudflare_zero_trust_access_policy.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_policy_9D8D690D: Destruction complete after 3s
cdktf  cloudflare_zero_trust_access_application.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_D8A92F3E (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_app): Creation complete after 3s [id=07ab194d-6678-4c15-abe1-7c81f2af0f5e]
       cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_certificate_E83230F5 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_certificate): Creating...
cdktf  cloudflare_zero_trust_access_policy.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_policy_D05C6E16 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_policy): Creating...
       cloudflare_zero_trust_tunnel_cloudflared_config.oci1_oci1-vault-tunnel_tunnel_config_oci1-vault-tunnel_A3D5E910 (oci1/oci1/oci1-vault-tunnel/tunnel_config_oci1-vault-tunnel): Modifications complete after 3s [id=dead9a0a-014b-47d7-b0c1-6e256ad60c3f]
       cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_app_oci2-us-phoenix-1-monitoring-tunnel_DEC9A5C2: Destruction complete after 1s
cdktf  cloudflare_zero_trust_access_policy.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_policy_D05C6E16 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_policy): Creation complete after 1s [id=01dff17a-ae25-40a0-a733-6c5603b4ff86]
       cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_oci2-us-phoenix-1-cicd-tunnel_53FE648A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_oci2-us-phoenix-1-cicd-tunnel): Creation complete after 4s [id=97678cc4-005d-47b3-9719-782453bce498]
cdktf  cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_app_oci2-us-phoenix-1-cicd-tunnel_B9119A9A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_app_oci2-us-phoenix-1-cicd-tunnel): Creating...
       cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_config_oci2-us-sanjose-1-auth-tunnel_DAA5878E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_config_oci2-us-sanjose-1-auth-tunnel): Modifications complete after 5s [id=1a54b4fc-edea-4531-97f2-34283bbf6091]
cdktf  cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_certificate_E83230F5 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_certificate): Creation complete after 2s [id=d081ed9adeba469b4e309b6ebd6b917c051a265cb67c9bee]
       oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ubuntu_instance_665A76B8 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ubuntu_instance): Creating...
cdktf  cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_app_oci2-us-phoenix-1-cicd-tunnel_B9119A9A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_app_oci2-us-phoenix-1-cicd-tunnel): Creation complete after 1s [id=14acec103134a4eb74da1d8abfecfca3]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_config_oci2-us-phoenix-1-cicd-tunnel_82FEA1E0 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_config_oci2-us-phoenix-1-cicd-tunnel): Creating...
cdktf  cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_config_oci2-us-phoenix-1-cicd-tunnel_82FEA1E0 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_config_oci2-us-phoenix-1-cicd-tunnel): Creation complete after 2s [id=97678cc4-005d-47b3-9719-782453bce498]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still modifying... [10s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A: Still destroying... [10s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ubuntu_instance_665A76B8 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ubuntu_instance): Still creating... [10s elapsed]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still modifying... [20s elapsed]
       oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A: Still destroying... [20s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ubuntu_instance_665A76B8 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ubuntu_instance): Still creating... [20s elapsed]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still modifying... [30s elapsed]
       oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A: Still destroying... [30s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ubuntu_instance_665A76B8 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ubuntu_instance): Still creating... [30s elapsed]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still modifying... [40s elapsed]
       oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A: Still destroying... [40s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ubuntu_instance_665A76B8 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ubuntu_instance): Creation complete after 36s [id=ocid1.instance.oc1.phx.anyhqljrvaxvekycp5chh3jwzjuzuw45qp3eedoaohurv4lrzrwks53yj66a]
       cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-record_0B972CEE (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-record): Creating...
cdktf  cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-record_0B972CEE (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-record): Creation complete after 1s [id=f5b551c993768536ea5f2aab1ac83940]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still modifying... [50s elapsed]
       oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A: Still destroying... [50s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A: Destruction complete after 55s
       cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_oci2-us-phoenix-1-monitoring-tunnel_1D6A8503: Destroying... [id=0d2fcf76-3818-4719-a2c8-7274e50c9e8f]
       cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_certificate_A60801EE: Destroying... [id=083bae34d0e9ea92be443e8b722598cb903d3dbfb39a4e26]
cdktf  cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_certificate_A60801EE: Destruction complete after 0s
       cloudflare_zero_trust_access_application.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_app_EBE2D141: Destroying... [id=9ad30c40-8c77-494f-af25-a3e3b51a5de9]
cdktf  cloudflare_zero_trust_access_application.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_ssh_app_EBE2D141: Destruction complete after 1s
cdktf  cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_oci2-us-phoenix-1-monitoring-tunnel_1D6A8503: Destruction complete after 2s
cdktf  random_id.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_secret_7446B080: Destroying... [id=d9AfnqX0ezd8PUqQVqlv3Av6KLwfbUnucuLTDYW1-smdeb0]
       random_id.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_secret_7446B080: Destruction complete after 0s
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still modifying... [1m0s elapsed]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still modifying... [1m10s elapsed]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still modifying... [1m20s elapsed]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still modifying... [1m30s elapsed]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still modifying... [1m40s elapsed]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still modifying... [1m50s elapsed]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still modifying... [2m0s elapsed]
cdktf  ╷
       │ Error: 409-Conflict, Volume ocid1.bootvolume.oc1.us-sanjose-1.abzwuljreozywd2p65q72syl76slcrlz5to6wyqgdm6c4h2ogj4b5rjxe7dq currently attached
       │ Suggestion: The resource is in a conflicted state. Please retry again or contact support for help with service: Core Instance
       │ Documentation: https://registry.terraform.io/providers/oracle/oci/latest/docs/resources/core_instance
       │ API Reference: https://docs.oracle.com/iaas/api/#/en/iaas/20160918/Instance/UpdateInstance
       │ Request Target: PUT https://iaas.us-sanjose-1.oraclecloud.com/20160918/instances/ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnyck75ebblulqacb6iyg56ff3jx7agfpnasohfjo3lm6hda
       │ Provider version: 6.10.0, released on 2024-09-19.
       │ Service: Core Instance
       │ Operation Name: UpdateInstance
       │ OPC request ID: faf725d4381d2ce7b35541a514227771/DFAFC50AAF3CDE3BA179D2DCF48E0709/68D3F5FD7CA84A6DA07B27081F60B828
       │
       │
       │   with oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance),
       │   on cdk.tf.json line 1472, in resource.oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance):
       │ 1472:       },
       │
       ╵
cdktf  Operation failed: failed running terraform apply (exit 1)


0 Stacks deploying     1 Stack done     0 Stacks waiting
Invoking Terraform CLI failed with exit code 1

```

</details>